In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ["Sachin","Yuvraj","Dhoni","Kohli","Ishant","Rohit"]
s = pd.Series(names)

In [3]:
s

0    Sachin
1    Yuvraj
2     Dhoni
3     Kohli
4    Ishant
5     Rohit
dtype: object

In [4]:
s[0]

'Sachin'

In [5]:
names = ["Sachin","Yuvraj","Dhoni","Kohli","Ishant","Rohit","Dhawan","Pant","Sehwag","Dravid","Hardik"]
scores = [90,67,120,100,10,None,44,53,48,43,60]
avg = [50.21,45.5,53.2,54.2,12.4,30.4,None,34.5,42.2,49.8,39.6]

dataset = {
    "names" : names,
    "scores" : scores,
    "avg" : avg
}

In [6]:
df = pd.DataFrame(dataset)

In [7]:
df.shape

(11, 3)

In [8]:
# will print top 5 observations
df.head()

    names  scores    avg
0  Sachin    90.0  50.21
1  Yuvraj    67.0  45.50
2   Dhoni   120.0  53.20
3   Kohli   100.0  54.20
4  Ishant    10.0  12.40

In [10]:
df['names'].head()

0    Sachin
1    Yuvraj
2     Dhoni
3     Kohli
4    Ishant
Name: names, dtype: object

In [11]:
df.head(8)

    names  scores    avg
0  Sachin    90.0  50.21
1  Yuvraj    67.0  45.50
2   Dhoni   120.0  53.20
3   Kohli   100.0  54.20
4  Ishant    10.0  12.40
5   Rohit     NaN  30.40
6  Dhawan    44.0    NaN
7    Pant    53.0  34.50

In [12]:
# will return last 5 observations
df.tail()

     names  scores   avg
6   Dhawan    44.0   NaN
7     Pant    53.0  34.5
8   Sehwag    48.0  42.2
9   Dravid    43.0  49.8
10  Hardik    60.0  39.6

In [13]:
df.describe()

           scores        avg
count   10.000000  10.000000
mean    63.500000  41.201000
std     32.084091  12.828614
min     10.000000  12.400000
25%     45.000000  35.775000
50%     56.500000  43.850000
75%     84.250000  50.107500
max    120.000000  54.200000

In [14]:
df['scores'] < 50

0     False
1     False
2     False
3     False
4      True
5     False
6      True
7     False
8      True
9      True
10    False
Name: scores, dtype: bool

In [15]:
df[df['scores'] < 50]

    names  scores   avg
4  Ishant    10.0  12.4
6  Dhawan    44.0   NaN
8  Sehwag    48.0  42.2
9  Dravid    43.0  49.8

In [17]:
df.isna()

    names  scores    avg
0   False   False  False
1   False   False  False
2   False   False  False
3   False   False  False
4   False   False  False
5   False    True  False
6   False   False   True
7   False   False  False
8   False   False  False
9   False   False  False
10  False   False  False

In [18]:
df.dropna()

     names  scores    avg
0   Sachin    90.0  50.21
1   Yuvraj    67.0  45.50
2    Dhoni   120.0  53.20
3    Kohli   100.0  54.20
4   Ishant    10.0  12.40
7     Pant    53.0  34.50
8   Sehwag    48.0  42.20
9   Dravid    43.0  49.80
10  Hardik    60.0  39.60

In [20]:
df.fillna(0)

     names  scores    avg
0   Sachin    90.0  50.21
1   Yuvraj    67.0  45.50
2    Dhoni   120.0  53.20
3    Kohli   100.0  54.20
4   Ishant    10.0  12.40
5    Rohit     0.0  30.40
6   Dhawan    44.0   0.00
7     Pant    53.0  34.50
8   Sehwag    48.0  42.20
9   Dravid    43.0  49.80
10  Hardik    60.0  39.60

In [22]:
df.iloc[0]

names     Sachin
scores        90
avg        50.21
Name: 0, dtype: object

In [23]:
df.loc[0]

names     Sachin
scores        90
avg        50.21
Name: 0, dtype: object

In [24]:
df.iloc[0:5,1]

0     90.0
1     67.0
2    120.0
3    100.0
4     10.0
Name: scores, dtype: float64

In [27]:
df.iloc[0,1] = 95

In [28]:
df

     names  scores    avg
0   Sachin    95.0  50.21
1   Yuvraj    67.0  45.50
2    Dhoni   120.0  53.20
3    Kohli   100.0  54.20
4   Ishant    10.0  12.40
5    Rohit     NaN  30.40
6   Dhawan    44.0    NaN
7     Pant    53.0  34.50
8   Sehwag    48.0  42.20
9   Dravid    43.0  49.80
10  Hardik    60.0  39.60